# CS779 Data Warehouse Project
### - Python, PostgreSQL, and Tableau integration -        by Kazuya Dohi

In [1]:
import numpy as np
import pandas as pd

import psycopg2
from sqlalchemy import create_engine

### Importing data

The M5 dataset from Walmart contains unit sales of various products sold in the United States,
organized as grouped time series.  
File 1: “calendar.csv” (1969, 14)  
File 2: “sell_prices.csv” (6841121, 4)  
File 3: “sales_train.csv” (30490, 1947) 

Data Source:  
https://www.kaggle.com/competitions/m5-forecasting-accuracy/data

In [2]:
datafile = 'data/'
sales_train = pd.read_csv(datafile + 'sales_train_evaluation.csv')
calendar = pd.read_csv(datafile + 'calendar.csv')
sell_prices = pd.read_csv(datafile + 'sell_prices.csv')

In [3]:
sales_train.shape, calendar.shape, sell_prices.shape

((30490, 1947), (1969, 14), (6841121, 4))

In [4]:
sales_train.head()

,id,item_id,dept_id,cat_id,store_id,state_id,d_1,d_2,d_3,d_4,...,d_1932,d_1933,d_1934,d_1935,d_1936,d_1937,d_1938,d_1939,d_1940,d_1941
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,4,0,0,0,0,3,3,0,1
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,1,2,1,1,0,0,0,0,0
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,0,2,0,0,0,2,3,0,1
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,1,0,4,0,1,3,0,2,6
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,0,0,2,1,0,0,2,1,0

In [5]:
calendar.head()

,date,wm_yr_wk,weekday,wday,month,year,d,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI
0,2011-01-29,11101,Saturday,1,1,2011,d_1,NaN,NaN,NaN,NaN,0,0,0
1,2011-01-30,11101,Sunday,2,1,2011,d_2,NaN,NaN,NaN,NaN,0,0,0
2,2011-01-31,11101,Monday,3,1,2011,d_3,NaN,NaN,NaN,NaN,0,0,0
3,2011-02-01,11101,Tuesday,4,2,2011,d_4,NaN,NaN,NaN,NaN,1,1,0
4,2011-02-02,11101,Wednesday,5,2,2011,d_5,NaN,NaN,NaN,NaN,1,0,1

In [6]:
sell_prices.head()

  store_id        item_id  wm_yr_wk  sell_price
0     CA_1  HOBBIES_1_001     11325        9.58
1     CA_1  HOBBIES_1_001     11326        9.58
2     CA_1  HOBBIES_1_001     11327        8.26
3     CA_1  HOBBIES_1_001     11328        8.26
4     CA_1  HOBBIES_1_001     11329        8.26

In [7]:
sell_prices = sell_prices[sell_prices['wm_yr_wk']>=11149] # use year 2
sell_prices = sell_prices[sell_prices['wm_yr_wk']<11250]
sell_prices['sell_price'] = round(sell_prices['sell_price'].astype('float'), 2)

### Downcasting

In [8]:
print('----- Before downcasting -----')
sales_train.info()

----- Before downcasting -----
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30490 entries, 0 to 30489
Columns: 1947 entries, id to d_1941
dtypes: int64(1941), object(6)
memory usage: 452.9+ MB

In [9]:
def downcast(df):
    float_cols = [col for col in df if df[col].dtype == 'float64']
    int_cols = [col for col in df if df[col].dtype in ['int64', 'int32']]
    object_cols = [col for col in df if df[col].dtype in ['object']]
    df[float_cols] = df[float_cols].astype(np.float32)
    df[int_cols] = df[int_cols].astype(np.int16)
    df[object_cols] = df[object_cols].astype('category')
    if (df.dtypes.index == 'date').sum()>0:
        df['date'] = pd.to_datetime(df['date'], format='%Y-%m-%d')
    return df

sales_train = downcast(sales_train.iloc[:, :709])  # used date 1~1096
calendar = downcast(calendar[calendar['year']==2012]).drop(['snap_CA', 'snap_TX', 'snap_WI'], axis=1)  # used year 2012
sell_prices = downcast(sell_prices)
print('----- After downcasting -----')
sales_train.info()

/Users/kazuyadohi/opt/anaconda3/lib/python3.9/site-packages/pandas/core/frame.py:3641: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[k1] = value[k2]
/var/folders/l5/vs9h02w96lg746f6fxwbk_dc0000gn/T/ipykernel_5431/3901761865.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['date'] = pd.to_datetime(df['date'], format='%Y-%m-%d')

----- After downcasting -----
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30490 entries, 0 to 30489
Columns: 709 entries, id to d_703
dtypes: category(6), int16(703)
memory usage: 42.4 MB

Note: The original sales data contains 1941-day (5 year) data, but the data size is reduced to 366 days for simplification.

### Melting dataset (transform wide form to long form)

In [10]:
# remove 'd_'
col_1 = sales_train.iloc[:,:6].columns.values
col_2 = np.array([d[2:] for d in sales_train.columns.values[6:]], dtype='object')
d_col = np.concatenate([col_1, col_2])
sales_train.columns = d_col

In [11]:
sales_train_melted = pd.melt(sales_train, 
                  id_vars = ['id', 'item_id', 'dept_id', 'cat_id', 'store_id', 'state_id'], 
                  var_name = 'date_id', value_name = "sales_quantity")
sales = sales_train_melted[sales_train_melted['date_id'].astype(int)>=338].drop(['id'], axis=1)  # use only year2 data (dL338~703)
sales.head()

,item_id,dept_id,cat_id,store_id,state_id,date_id,sales_quantity
10275130,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,338,0
10275131,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,338,0
10275132,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,338,0
10275133,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,338,0
10275134,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,338,1

### Loading data into PostgreSQL

#### Temp table creation

In [12]:
create_table_calendar = '''
CREATE TABLE Calendar(
date          timestamp(3) NOT NULL,
wm_yr_wk      numeric(5) NOT NULL,
weekday       varchar(9) NOT NULL,
wday          numeric(1) NOT NULL,
month         numeric(2) NOT NULL,
year          numeric(4) NOT NULL,
d             varchar(6) NOT NULL,
event_name_1  varchar(32),
event_type_1  varchar(32),
event_name_2  varchar(32),
event_type_2  varchar(32));
'''
create_table_sells = '''
CREATE TABLE Sells(
item_id        varchar(64) NOT NULL,
dept_id        varchar(64) NOT NULL,
cat_id         varchar(64) NOT NULL,
state_id       varchar(2) NOT NULL,
store_id       varchar(6) NOT NULL,
date_id              numeric(5) NOT NULL,
sales_quantity  numeric(4) NOT NULL);
'''
create_table_price = '''
CREATE TABLE SellPrice(
store_id       varchar(6) NOT NULL,
item_id        varchar(64) NOT NULL,
wm_yr_wk       numeric(5) NOT NULL,
sell_price     numeric(6,2) NOT NULL);
'''

In [13]:
def table_creation(sql_name, name):
    host = 'localhost'; database = 'CS779_Project_new';
    user = 'postgres'; password = 'password';
    port = '5432';

    conn = psycopg2.connect(
                host = host, database = database,
                user = user, password = password,
                port = port)
    cursor = conn.cursor()
    
    # drop table if it already exists, and create new table
    cursor.execute('drop table if exists ' + name)
    cursor.execute(sql_name)
    
    conn.commit()
    conn.close()

#table_creation(create_table_calendar, 'Calendar')
#table_creation(create_table_sells, 'Sells')
#table_creation(create_table_price, 'SellPrice')

In [14]:
def table_load(load_data, name):
    conn_string = 'postgresql://postgres:password@localhost:5432/CS779_Project_new'
    db = create_engine(conn_string)
    conn = db.connect()

    load_data.to_sql(name, con=conn, if_exists='append', index=False)

    conn = psycopg2.connect(conn_string)
    conn.autocommit = True
    cursor = conn.cursor()

    conn.commit()
    conn.close()

#table_load(calendar, 'calendar')
#table_load(sales, 'sells')
#table_load(sell_prices, 'sellprice')